app/controllers/admin/links_controller.rb

  def index
    @links = Link.all
---
SELECT * FROM "links"