app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE (publish_at <= CURRENT_TIMESTAMP) ORDER BY publish_at DESC LIMIT 5
---
  def index
    @posts = (@parent ? @parent.posts : current_site.posts).search(params[:q], :page => current_page)